app/views/order_items/index.html.erb

      <% if order_item.item.active %>
        <% if can? :update, order_item.order %>
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1