app/views/order_items/show.html.erb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
        <td><div class="text-center"><strong>Order Description</strong></div></td>
        <td colspan="2"><div class="text-center"><%= @order_item.order.description %></div></td>