app/controllers/items_controller.rb

INSERT INTO `items` (`name`, `quantity`, `price`, `created_at`, `updated_at`) VALUES ('Item 4', 10, 450, '2017-11-14 08:04:22.452629', '2017-11-14 08:04:22.452629')
---
  def create
    success = false
    if @item.save

UPDATE `items` SET `quantity` = 100, `updated_at` = '2017-11-14 08:04:03.969544' WHERE `items`.`id` = 1
---
  def update
    success = false
    if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 4
DELETE FROM `order_items` WHERE `order_items`.`id` = 10
---
  def destroy
    item_found, item_deleted = false, false
    item_found = true if OrderItem.joins(:item).where(items: {name: @item.name}).any?

    if item_found
      item_deleted = true if @item.update(active: false)
    else
      item_deleted = true if @item.destroy