app/controllers/order_items_controller.rb

  def destroy
    if @order_item.order.status != 'Completed'
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1