app/controllers/order_items_controller.rb

SELECT `items`.* FROM `items`
---
  def new
    @items = Item.all

SELECT `items`.* FROM `items`
---
  def edit
    @items = Item.all

SELECT `items`.* FROM `items`
INSERT INTO `order_items` (`item_id`, `quantity`, `order_id`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2017-11-13 12:52:18.747012', '2017-11-13 12:52:18.747012')
UPDATE `items` SET `quantity` = 5, `updated_at` = '2017-11-14 08:19:01.250463' WHERE `items`.`id` = 7
---
  def create
    @items = Item.all
    if @order_item.item.quantity >= @order_item.quantity
      OrderItem.transaction do
        if @order_item.save

SELECT `items`.* FROM `items`
UPDATE `items` SET `quantity` = -6, `updated_at` = '2017-11-14 08:30:44.016535' WHERE `items`.`id` = 7
UPDATE `order_items` SET `item_id` = 6, `quantity` = 33, `updated_at` = '2017-11-14 13:03:49.100052' WHERE `order_items`.`id` = 10
---
  def update
    @items = Item.all
    if check_updated_quantity
      if @order_item.update(order_item_params)

DELETE FROM `order_items` WHERE `order_items`.`id` = 2
---
  def destroy
    if @order_item.destroy