app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2 AND (1=1)
---
  def index
    if @user.waiter?
      @orders = @user.orders

INSERT INTO `orders` (`status`, `description`, `delivery_time`, `user_id`, `created_at`, `updated_at`) VALUES ('In progress', '9th order', '2017-11-14 12:58:00.000000', 1, '2017-11-14 12:59:11.157227', '2017-11-14 12:59:11.157227')
---
  def create
    if current_user.admin?
      @order.user = current_user
    end
    if @order.save

UPDATE `orders` SET `status` = 'Pending', `description` = 'wqwqwqwlll', `delivery_time` = '2017-11-20 14:42:00.000000', `updated_at` = '2017-11-20 14:01:09.048337' WHERE `orders`.`id` = 13
---
  def update
    if @order.update(order_params)

DELETE FROM `orders` WHERE `orders`.`id` = 3
---
  def destroy
    if @order.destroy