app/controllers/registrations_controller.rb

INSERT INTO `users` (`email`, `name`, `encrypted_password`, `created_at`, `updated_at`, `confirmation_token`, `confirmation_sent_at`) VALUES ('sehr.nadeem@7vals.com', 'sehrNadeem', '$2a$10$daIkZ/bY6KE.8VBbAYzkq.QXwkPuXtTy/SvhZbW7/yhJAX8gg96q.', '2017-11-16 06:53:14.472242', '2017-11-16 06:53:14.472242', '101d1126f3d1c7bc4d6d54edb9dc279b6b45c56b4ebd79f751149499f6546f4d', '2017-11-16 06:53:14.638350')
---
  def create
    success = false
    @user = User.new(configure_sign_up_params)
    if success = @user.save